---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussUserDefinedMemberDeleted
source: html/9c5cf96a-abb9-c4e0-4a5a-7a608f8f7b6f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussUserDefinedMemberDeleted Property

A user-defined structural member was deleted due to missing or deleted references.

## Syntax (C#)
```csharp
public static FailureDefinitionId TrussUserDefinedMemberDeleted { get; }
```